---
kind: method
id: M:Autodesk.Revit.DB.EdgeArrayArray.ForwardIterator
source: html/1b3aab39-84c9-7592-7be2-060c68e1d276.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual EdgeArrayArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.